Tekla Open API Reference for Tekla Structures 2025
ModificationStamp Class
 The ModificationStamp class provides the modification stamp for the objects of the model that is currently open in Tekla Structures.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.History.ModificationStamp
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ModificationStamp
<SerializableAttribute>
Public NotInheritable Class ModificationStamp
The ModificationStamp type exposes the following members.
Constructors
Name | Description
ModificationStamp()
 Creates a new modification stamp instance where the current modification stamp is 0. Can be used for fetching all the created or deleted model objects from the model history.
ModificationStamp(Int32, Int32)
 Creates a new modification stamp instance with the given local and server stamps. Can be used for fetching from the model history all the model objects that have been created or deleted after the specified stamp.
Top
Properties
Name | Description
Guid
Guid representation
LocalStamp
 The modification stamp for the local changes.
ServerStamp
 The modification stamp from the multi-user server for the external changes caused by the saving of the multi-user model.
Top
See Also
Reference
Tekla.Structures.Model.History Namespace